// 1. Напишите программу, которая выводит на экран "Hello, World!".
Console.WriteLine("Hello, World!");
