// 7. Напишите программу, которая находит сумму всех чисел от 1 до 100 и выводит результат на экран.

int summ = 0;
for (int i = 1; i <= 100; i++)
{ 
summ += i;
}
Console.WriteLine(summ);
