//4. Напишите программу, которая определяет, является ли введенное пользователем число четным или нечетным.
Console.Write("Введите число:");
int n=int.Parse(Console.ReadLine()!);
if (n % 2 == 0) Console.WriteLine("Число четное");
else Console.WriteLine("Число не четное");

